* Dissertation
This is my dissertation, a quantitative investigation of description in British literature, tentatively titled: "The Eye of Modernism: Visual Imaginations of British literature, 1880-1930."

[[https://github.com/JonathanReeve/dissertation-prospectus/blob/master/reeve-prospectus.pdf][Read a more thorough description in my dissertation prospectus, here.]]

** Word counts

#+BEGIN_SRC sh :exports results
wc -w 00-introduction/introduction.org 01-colors/ch-1.org 02-shapes/ch-2.org 03-images/ch-3.org
#+END_SRC

#+RESULTS:
|   855 | 00-introduction/introduction.org |
| 33052 | 01-colors/ch-1.org               |
| 14295 | 02-shapes/ch-2.org               |
| 16863 | 03-images/ch-3.org               |
| 65065 | total                            |

** Revisions

Here are the last few revisions, of which this draft is the latest.

#+BEGIN_SRC sh :exports results
git log --pretty --format='%h %ai' | head -n 5
#+END_SRC

#+RESULTS:
| 6d38f61 | 2022-11-30 | 11:32:45 | -500 |
| e109caf | 2022-11-30 | 11:32:29 | -500 |
| 09e05c6 | 2022-11-30 | 11:31:34 | -500 |
| 0aa6c37 | 2022-11-27 | 00:35:46 | -500 |
| 82d1341 | 2022-11-27 | 00:33:16 | -500 |


** Building

I don't know why you would want to build a copy of my dissertation from scratch, but if you did:

Building requires the Nix package manager. Install nix, and then run:

#+begin_src sh
nix-shell --run shake
#+end_src

(Unless you have ~direnv~ installed, in which case you can just run ~direnv allow~ once, and then ~shake~.)
